// Задача 19

// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. (можно решить через строку, а можно математически)

// 14212 -> нет
// 12821 -> да
// 23432 -> да

//==============================================================================================================================================================

//Решение:

// Console.WriteLine("Введите целое пятизначное число для проверки на палиндромность: ");

// double num = double.Parse(Console.ReadLine()!);
// string answer = "";
// int minNum = 10000;
// int maxNum = 100000;
// double num2 = num;

// if ((num >= minNum) && (num < maxNum)){
//     for (int i = 10000; i >= 1000; i /= 10){
//         if(Math.Floor(num / i % 10) == (num2 % 10)){
//             answer = $"Число {num} палендром";
//             num2 = Math.Floor(num2 / 10);
//         } else {
//             answer = $"Число {num} не палендром";
//             break;
//         }
//     }
//     Console.WriteLine(answer);
// } else {
//     Console.WriteLine("Вы ввели некорректное число.");
// }

//==============================================================================================================================================================